import { OccGr } from 'types/sensei-web';


export const aptOccGr: OccGr = {
    '1': "動植物の採取,飼育,栽培",
    '2': "動物管理,水産養殖,園芸",
    '3': "身体作業",
    '4': "手腕作業",
    '5': "機械操作",
    '6': "加工,組立",
    '7': "建設,設備工事",
    '8': "切削加工,造形",
    '9': "手工技能",
    '10': "製図関連",
    '11': "機械,装置の運転看視",
    '12': "機械設備の保守管理",
    '13': "据付機関,建設機械運転",
    '14': "車両等の運転",
    '15': "航空機,船舶の操縦",
    '16': "測定,分析",
    '17': "工学,技術の開発応用",
    '18': "自然科学系の研究",
    '19': "診断,治療",
    '20': "人文科学系の研究",
    '21': "法務,財務等",
    '22': "教習,訓練,指導",
    '23': "教育,指導",
    '24': "デザイン,写真",
    '25': "通信",
    '26': "著述,編集,報道",
    '27': "介護サービス",
    '28': "養護,看護,保健医療",
    '29': "相談助言",
    '30': "販売",
    '31': "理容,美容",
    '32': "個人サービス",
    '33': "専門技術的な販売",
    '34': "警備,巡視",
    '35': "警察,保安",
    '36': "簡易事務",
    '37': "事務機器操作",
    '38': "一般事務",
    '39': "経理,会計",
    '40': "専門企画",
};

// export const addScoreMatchCondition = [
//     '',
//     '',
//     'addScores.G < 90 || addScores.V < 75',
//     'addScores.K < 75',
// ]

// export const aptScoreMatchCondition = [
//     '',
//     '',
//     'aptScores.G < 90 || aptScores.V < 75',
//     'aptScores.K < 75',
// ]